PS-PK-monitoring/raw/res.ps57.long.try3/res.thr46.ro.txt
sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 46
Report intermediate results every 10 second(s)
Initializing random number generator from timer.

Random number generator seed is 0 and will be ignored

Forcing shutdown in 301 seconds

Threads started!

[  10s] threads: 46, tps: 0.00, reads: 321905.93, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[  20s] threads: 46, tps: 0.00, reads: 356683.58, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 46, tps: 0.00, reads: 356583.04, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[  40s] threads: 46, tps: 0.00, reads: 356437.39, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[  50s] threads: 46, tps: 0.00, reads: 356586.84, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 46, tps: 0.00, reads: 356751.04, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[  70s] threads: 46, tps: 0.00, reads: 356850.66, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[  80s] threads: 46, tps: 0.00, reads: 357078.43, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[  90s] threads: 46, tps: 0.00, reads: 356657.07, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[ 100s] threads: 46, tps: 0.00, reads: 356615.96, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[ 110s] threads: 46, tps: 0.00, reads: 356651.07, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[ 120s] threads: 46, tps: 0.00, reads: 356506.99, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[ 130s] threads: 46, tps: 0.00, reads: 356592.28, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[ 140s] threads: 46, tps: 0.00, reads: 356816.78, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[ 150s] threads: 46, tps: 0.00, reads: 356465.08, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[ 160s] threads: 46, tps: 0.00, reads: 356581.16, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[ 170s] threads: 46, tps: 0.00, reads: 356574.41, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[ 180s] threads: 46, tps: 0.00, reads: 356376.96, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[ 190s] threads: 46, tps: 0.00, reads: 356456.53, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[ 200s] threads: 46, tps: 0.00, reads: 356172.84, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[ 210s] threads: 46, tps: 0.00, reads: 356007.41, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[ 220s] threads: 46, tps: 0.00, reads: 356263.40, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[ 230s] threads: 46, tps: 0.00, reads: 357138.34, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[ 240s] threads: 46, tps: 0.00, reads: 356782.13, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[ 250s] threads: 46, tps: 0.00, reads: 356619.49, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[ 260s] threads: 46, tps: 0.00, reads: 356960.28, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[ 270s] threads: 46, tps: 0.00, reads: 356561.37, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[ 280s] threads: 46, tps: 0.00, reads: 357066.46, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
[ 290s] threads: 46, tps: 0.00, reads: 357029.71, writes: 0.00, response time: 0.25ms (95%), errors: 0.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            106643548
        write:                           0
        other:                           0
        total:                           106643548
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 106643548 (355478.19 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0003s
    total number of events:              106643548
    total time taken by event execution: 13498.6784s
    response time:
         min:                                  0.06ms
         avg:                                  0.13ms
         max:                                 13.92ms
         approx.  95 percentile:               0.25ms

Threads fairness:
    events (avg/stddev):           2318338.0000/7478.28
    execution time (avg/stddev):   293.4495/0.17